Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/Resources/SolicitaFinanciamientoTC/wsdl/solicitaFinanciamientoTCPS.wsdl

<wsdl:definitions name="solicitaFinanciamientoTCPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/solicitaFinanciamientoTCPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/solicitaFinanciamientoTCPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:def="http://www.ficohsa.com.hn/middleware.services/solicitudFinanciamientoTCTypes">

  <wsdl:types>
    <xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/solicitudFinanciamientoTCTypes" schemaLocation="../../SolicitudFinanciamientoTC/xsd/solicitudFinanciamientoTCTypes.xsd"/>
	</xsd:schema>
  </wsdl:types> 
  
  	<wsdl:message name="solicitaFinanciamientoTCRequest">
		<wsdl:part element="def:solicitaFinanciamientoTC" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="solicitaFinanciamientoTCResponse">
		<wsdl:part element="def:solicitaFinanciamientoTCResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>
	
	<wsdl:portType name="solicitaFinanciamientoTCPS">
		<wsdl:operation name="solicitaFinanciamientoTC" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:solicitaFinanciamientoTCRequest"/>
			<wsdl:output message="fic:solicitaFinanciamientoTCResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="solicitaFinanciamientoTCPSSOAP" type="fic:solicitaFinanciamientoTCPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="solicitaFinanciamientoTC">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/solicitaFinanciamientoTCPS/solicitaFinanciamientoTC"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:solicitaFinanciamientoTCRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:solicitaFinanciamientoTCResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation> 
	</wsdl:binding>
	
	<wsdl:service name="solicitaFinanciamientoTCPS">
	    <wsdl:port binding="fic:solicitaFinanciamientoTCPSSOAP" name="solicitaFinanciamientoTCPSSOAP">
	    	<soap:address location="http://172.23.13.19:8003/Middleware/OperationsAndExecution/Cards/SolicitudFinanciamientoTC"/>
		</wsdl:port>
	</wsdl:service>
	
</wsdl:definitions>